Revit 2027 API
LightFamily.GetNumberOfLightTypes Method
 Return the number of light types contained in this light family
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetNumberOfLightTypes()
Public Function GetNumberOfLightTypes As Integer
public:
int GetNumberOfLightTypes()
member GetNumberOfLightTypes : unit -> int
Return Value
Int32
 The number of light types contained in this light family
See Also
Reference
LightFamily Class
Autodesk.Revit.DB.Lighting Namespace